apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
/****************************************************************************
 * arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_ESP32C3_BIGNUM_ACCELERATOR

#include <stdio.h>
#include <string.h>
#include <limits.h>
#include <assert.h>
#include <stdlib.h>
#include <sys/param.h>

#include <nuttx/debug.h>
#include <nuttx/mutex.h>

#include "riscv_internal.h"
#include "hardware/esp32c3_rsa.h"
#include "hardware/esp32c3_system.h"

#include "esp32c3_bignum.h"

/****************************************************************************
 * Pre-processor Macros
 ****************************************************************************/

#define SOC_RSA_MAX_BIT_LEN (3072)

#define CIL  (sizeof(uint32_t))             /* chars in limb */
#define BIL  (CIL << 3)                     /* bits in limb */
#define BIH  (CIL << 2)                     /* half limb size */

#define MPI_SIZE_T_MAX  ((size_t) -1)       /* SIZE_T_MAX is not standard */

/* Convert between bits/chars and number of limbs
 * Divide first in order to avoid potential overflows
 */

#define BITS_TO_LIMBS(i)  ((i) / BIL + ((i) % BIL != 0))
#define CHARS_TO_LIMBS(i) ((i) / CIL + ((i) % CIL != 0))

/* Get a specific byte, without range checks. */
#define BYTE_BITS         (8)
#define BYTE_CHECKS       (0xff)
#define GET_BYTE(X, i)    (((X)->p[(i) / CIL] >> \
                          (((i) % CIL) * BYTE_BITS)) & BYTE_CHECKS)

/****************************************************************************
 * Private Data
 ****************************************************************************/

static mutex_t g_rsa_lock = NXMUTEX_INITIALIZER;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_mpi_to_mem_block
 *
 * Description:
 *   Copy MPI bignum 'mpi' to hardware memory block.
 *
 * Input Parameters:
 *   mem_base    - The hardware memory block
 *   mpi         - The bignum 'mpi' from the previous calculation
 *   num_words   - The number of words to be represented
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_to_mem_block(uint32_t mem_base,
                                     const struct esp32c3_mpi_s *mpi,
                                     size_t num_words)
{
  uint32_t *pbase = (uint32_t *)mem_base;
  uint32_t copy_words = MIN(num_words, mpi->n);
  int i;

  /* Copy MPI data to memory block registers */

  memcpy(pbase, mpi->p, copy_words * sizeof(uint32_t));

  /* Zero any remaining memory block data */

  for (i = copy_words; i < num_words; i++)
    {
      pbase[i] = 0;
    }
}

/****************************************************************************
 * Name: esp32c3_mem_block_to_mpi
 *
 * Description:
 *   Read MPI bignum back from hardware memory block.
 *
 * Input Parameters:
 *   x           - The result from the previous calculation
 *   mem_base    - The hardware memory block
 *   num_words   - The number of words to be represented
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mem_block_to_mpi(struct esp32c3_mpi_s *x,
                                     uint32_t mem_base, int num_words)
{
  int i;

  /* Copy data from memory block registers */

  const size_t REG_WIDTH = sizeof(uint32_t);
  for (i = 0; i < num_words; i++)
    {
      x->p[i] = getreg32(mem_base + (i * REG_WIDTH));
    }

  /* Zero any remaining limbs in the bignum,
   * if the buffer is bigger than num_words
   */

  for (i = num_words; i < x->n; i++)
    {
      x->p[i] = 0;
    }
}

/****************************************************************************
 * Name: esp32c3_mpi_start_op
 *
 * Description:
 *   Begin an RSA operation.
 *
 * Input Parameters:
 *   op_reg   - Specifies which 'START' register to write to.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_start_op(uint32_t op_reg)
{
  /* Clear interrupt status */

  putreg32(1, RSA_CLEAR_INTERRUPT_REG);

  /* Note: above putreg32 includes a memw, so we know any writes
   * to the memory blocks are also complete.
   */

  putreg32(1, op_reg);
}

/****************************************************************************
 * Name: esp32c3_mpi_wait_op_complete
 *
 * Description:
 *   Wait for an RSA operation to complete.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_wait_op_complete(void)
{
  while (getreg32(RSA_IDLE_REG) != 1)
    {
    }

  /* clear the interrupt */

