apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  putreg32(1, RSA_CLEAR_INTERRUPT_REG);
}

/****************************************************************************
 * Name: esp32c3_mpi_enable_hardware_hw_op
 *
 * Description:
 *   Enable the MPI hardware and acquire the lock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_enable_hardware_hw_op(void)
{
  nxmutex_lock(&g_rsa_lock);

  /* Enable RSA hardware */

  modifyreg32(SYSTEM_PERIP_CLK_EN1_REG, 0, SYSTEM_CRYPTO_RSA_CLK_EN);
  modifyreg32(SYSTEM_PERIP_RST_EN1_REG, (SYSTEM_CRYPTO_RSA_RST |
                                         SYSTEM_CRYPTO_DS_RST), 0);

  modifyreg32(SYSTEM_RSA_PD_CTRL_REG, SYSTEM_RSA_MEM_PD, 0);

  while (getreg32(RSA_CLEAN_REG) != 1)
    {
    }
}

/****************************************************************************
 * Name: esp32c3_mpi_disable_hardware_hw_op
 *
 * Description:
 *   Disable the MPI hardware and release the lock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_disable_hardware_hw_op(void)
{
  modifyreg32(SYSTEM_RSA_PD_CTRL_REG, 0, SYSTEM_RSA_MEM_PD);

  /* Disable RSA hardware */

  modifyreg32(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_CRYPTO_RSA_CLK_EN, 0);
  modifyreg32(SYSTEM_PERIP_RST_EN1_REG, 0, SYSTEM_CRYPTO_RSA_RST);

  nxmutex_unlock(&g_rsa_lock);
}

/****************************************************************************
 * Name: esp32c3_mpi_read_result_hw_op
 *
 * Description:
 *   Read out the result from the previous calculation.
 *
 * Input Parameters:
 *   Z          - The result from the previous calculation
 *   z_words    - The number of words to be represented
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_read_result_hw_op(struct esp32c3_mpi_s *Z,
                                          size_t z_words)
{
  esp32c3_mpi_wait_op_complete();
  esp32c3_mem_block_to_mpi(Z, RSA_MEM_Z_BLOCK_REG, z_words);
}

/****************************************************************************
 * Name: esp32c3_mpi_mul_mpi_hw_op
 *
 * Description:
 *   Starts a (X * Y) calculation in hardware.
 *
 * Input Parameters:
 *   X          - First multiplication argument
 *   Y          - Second multiplication argument
 *   n_words    - The number of words to be represented
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_mul_mpi_hw_op(const struct esp32c3_mpi_s *X,
                                      const struct esp32c3_mpi_s *Y,
                                      size_t n_words)
{
  /* Copy X (right-extended) & Y (left-extended) to memory block */

  esp32c3_mpi_to_mem_block(RSA_MEM_X_BLOCK_REG, X, n_words);
  esp32c3_mpi_to_mem_block(RSA_MEM_Z_BLOCK_REG + n_words * 4, Y, n_words);

  putreg32(((n_words * 2) - 1), RSA_MODE_REG);
  esp32c3_mpi_start_op(RSA_MULT_START_REG);
}

/****************************************************************************
 * Name: esp32c3_mpi_mult_failover_mod_op
 *
 * Description:
 *   Special-case of (X * Y), where we use hardware montgomery mod
 *   multiplication to calculate result where either A or B are > 2048 bits
 *   so can't use the standard multiplication method.
 *
 * Input Parameters:
 *   X          - First multiplication argument
 *   Y          - Second multiplication argument
 *   num_words  - The number of words to be represented
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_mult_failover_mod_op(const struct esp32c3_mpi_s *X,
                                             const struct esp32c3_mpi_s *Y,
                                             size_t num_words)
{
  int i;

  /* M = 2^num_words - 1, so block is entirely FF */

  for (i = 0; i < num_words; i++)
    {
      putreg32(UINT32_MAX, RSA_MEM_M_BLOCK_REG + i * 4);
    }

  /* mprime = 1 */

  putreg32(1, RSA_M_PRIME_REG);
  putreg32(num_words - 1, RSA_MODE_REG);

  /* Load X & Y */

  esp32c3_mpi_to_mem_block(RSA_MEM_X_BLOCK_REG, X, num_words);
  esp32c3_mpi_to_mem_block(RSA_MEM_Y_BLOCK_REG, Y, num_words);

  /* rinv = 1, write first word */

  putreg32(1, RSA_MEM_RB_BLOCK_REG);

  /* Zero out rest of the rinv words */

  for (i = 1; i < num_words; i++)
    {
      putreg32(0, RSA_MEM_RB_BLOCK_REG + i * 4);
    }

  esp32c3_mpi_start_op(RSA_MODMULT_START_REG);
}

/****************************************************************************
 * Name: esp32c3_mpi_zeroize
 *
 * Description:
 *   Zero any limbs data.
 *
 * Input Parameters:
 *   v     - The pointer to limbs
 *   n     - The total number of limbs
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_mpi_zeroize(uint32_t *v, size_t n)
{
  memset(v, 0, CIL * n);
}

/****************************************************************************
 * Name: bits_to_words
 *
 * Description:
 *   Convert bit count to 32-bits word count.
 *
 * Input Parameters:
 *   bits  - The number of bit count
 *
 * Returned Value:
 *   Number of words count.
 *
 ****************************************************************************/

static size_t bits_to_words(size_t bits)
{
  return (bits + 31) / 32;
}

/****************************************************************************
 * Name: mpi_sub_hlp
 *
 * Description:
 *   Helper for esp32c3_mpi subtraction
 *
 * Input Parameters:
 *   n       - Number of limbs of \p d and \p s
 *   d       - On input, the left operand, On output, the result operand
 *   s       - The right operand
 *
 * Returned Value:
 *   \c 1 if \p `d < \p s`.
 *   \c 0 if \p `d >= \p s`..
 *
 ****************************************************************************/

static uint32_t mpi_sub_hlp(size_t n,
                            uint32_t *d,
                            const uint32_t *s)
{
  size_t i;
  uint32_t c;
  uint32_t z;

  for (i = c = 0; i < n; i++, s++, d++)
    {
      z   = (*d <  c);
      *d -= c;
      c   = (*d < *s) + z;
      *d -= *s;
    }

  return c;
}

/****************************************************************************
 * Name: mpi_mul_addc
 *
 * Description:
 *   Helper for esp32c3_mpi multiplication
 *
 * Input Parameters:
 *   count   - The count of limbs
 *   c       - The result number of limbs
 *   s       - The target number of limbs
 *   d       - The pointer to limbs
 *   b       - The total number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static inline void mpi_mul_addc(uint32_t count, uint32_t *c,
                                uint32_t **s, uint32_t **d, uint32_t b)
{
  uint32_t s0;
  uint32_t s1;
  uint32_t b0;
  uint32_t b1;
  uint32_t r0;
  uint32_t r1;
  uint32_t rx;
  uint32_t ry;

