apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  b0 = (b << BIH) >> BIH;
  b1 = (b >> BIH);

  for (int i = 0; i < count; ++i)
    {
      s0 = (**s << BIH) >> BIH;
      s1 = (**s >> BIH);
      (*s)++;
      rx = s0 * b1;
      r0 = s0 * b0;
      ry = s1 * b0;
      r1 = s1 * b1;
      r1 += (rx >> BIH);
      r1 += (ry >> BIH);
      rx <<= BIH;
      ry <<= BIH;
      r0 += rx;
      r1 += (r0 < rx);
      r0 += ry;
      r1 += (r0 < ry);
      r0 += *c;
      r1 += (r0 < *c);
      r0 += **d;
      r1 += (r0 < **d);
      *c = r1;
      *((*d)++) = r0;
    }
}

/****************************************************************************
 * Name: mpi_mul_hlp
 *
 * Description:
 *   Helper for esp32c3_mpi multiplication
 *
 * Input Parameters:
 *   i       - The MPI context to grow
 *   s       - The target number of limbs
 *   d       - The pointer to limbs
 *   b       - The total number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static void mpi_mul_hlp(size_t i, uint32_t *s, uint32_t *d, uint32_t b)
{
  uint32_t c = 0;

  for (; i >= 16; i -= 16)
    {
      mpi_mul_addc(16, &c, &s, &d, b);
    }

  for (; i >= 8; i -= 8)
    {
      mpi_mul_addc(8, &c, &s, &d, b);
    }

  for (; i > 0; i--)
    {
      mpi_mul_addc(1, &c, &s, &d, b);
    }

  do
    {
      *d += c;
      c = (*d < c);
      d++;
    }
  while (c != 0);
}

/****************************************************************************
 * Name: mpi_safe_cond_assign
 *
 * Description:
 *   Conditionally assign dest = src, without leaking information
 *   about whether the assignment was made or not.
 *
 * Input Parameters:
 *   n       - The MPI context to grow
 *   dest    - The MPI to conditionally assign to
 *   src     - The MPI to conditionally assign from
 *   assign  - The condition deciding whether perform the assignment or not
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void mpi_safe_cond_assign(size_t n,
                                 uint32_t *dest,
                                 const uint32_t *src,
                                 unsigned char assign)
{
  size_t i;
  for (i = 0; i < n; i++)
    {
      dest[i] = dest[i] * (1 - assign) + src[i] * assign;
    }
}

/****************************************************************************
 * Name: mpi_montg_init
 *
 * Description:
 *   Fast Montgomery initialization
 *
 * Input Parameters:
 *   X       - The MPI context to grow
 *   nblimbs - The target number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static void mpi_montg_init(uint32_t *mm, const struct esp32c3_mpi_s *N)
{
  uint32_t x;
  uint32_t m0 = N->p[0];
  unsigned int i;

  x = m0 + (((m0 + 2) & 4) << 1);

  for (i = BIL; i >= 8; i /= 2)
    {
      x *= (2 - (m0 * x));
    }

  *mm = ~x + 1;
}

/****************************************************************************
 * Name: mpi_montmul
 *
 * Description:
 *   Montgomery multiplication: A = A * B * R^-1 mod N
 *
 * Input Parameters:
 *   A   - One of the numbers to multiply,
 *         It must have at least as many limbs as N
 *         (A->n >= N->n), and any limbs beyond n are ignored.
 *         On successful completion, A contains the result of
 *         the multiplication A * B * R^-1 mod N where
 *         R = (2^CIL)^n.
 *   B   - One of the numbers to multiply, It must be nonzero
 *         and must not have more limbs than N (B->n <= N->n)
 *   N   - The modulo. N must be odd.
 *   mm  - The value calculated by `mpi_montg_init(&mm, N)`.
 *         This is -N^-1 mod 2^CIL.
 *   T   - A bignum for temporary storage.
 *         It must be at least twice the limb size of N plus 2
 *         (T->n >= 2 * (N->n + 1)).
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void mpi_montmul(struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B,
                        const struct esp32c3_mpi_s *N,
                        uint32_t mm,
                        const struct esp32c3_mpi_s *T)
{
  size_t i;
  size_t n;
  size_t m;
  uint32_t u0;
  uint32_t u1;
  uint32_t *d;

  memset(T->p, 0, T->n * CIL);

  d = T->p;
  n = N->n;
  m = (B->n < n) ? B->n : n;

  for (i = 0; i < n; i++)
    {
      /* T = (T + u0*B + u1*N) / 2^BIL */

      u0 = A->p[i];
      u1 = (d[0] + u0 * B->p[0]) * mm;

      mpi_mul_hlp(m, B->p, d, u0);
      mpi_mul_hlp(n, N->p, d, u1);

      *d++ = u0;
      d[n + 1] = 0;
    }

  /* At this point, d is either the desired result or the desired result
   * plus N. We now potentially subtract N, avoiding leaking whether the
   * subtraction is performed through side channels.
   */

  /* Copy the n least significant limbs of d to A, so that
   * A = d if d < N (recall that N has n limbs).
   */

  memcpy(A->p, d, n * CIL);

  /* If d >= N then we want to set A to d - N. To prevent timing attacks,
   * do the calculation without using conditional tests.
   */

  /* Set d to d0 + (2^BIL)^n - N where d0 is the current value of d.
   */

  d[n] += 1;
  d[n] -= mpi_sub_hlp(n, d, N->p);
  /* If d0 < N then d < (2^BIL)^n
   * so d[n] == 0 and we want to keep A as it is.
   * If d0 >= N then d >= (2^BIL)^n, and d <= (2^BIL)^n + N < 2 * (2^BIL)^n
   * so d[n] == 1 and we want to set A to the result of the subtraction
   * which is d - (2^BIL)^n, i.e. the n least significant limbs of d.
   * This exactly corresponds to a conditional assignment.
   */

  mpi_safe_cond_assign(n, A->p, d, (unsigned char) d[n]);
}

/****************************************************************************
 * Name: mpi_montred
 *
 * Description:
 *   Montgomery reduction: A = A * R^-1 mod N
 *
 * Input Parameters:
 *   A   - One of the numbers to multiply,
 *         It must have at least as many limbs as N
 *         (A->n >= N->n), and any limbs beyond n are ignored.
 *         On successful completion, A contains the result of
 *         the multiplication A * B * R^-1 mod N where
 *         R = (2^CIL)^n.
 *   N   - The modulo. N must be odd.
 *   mm  - The value calculated by `mpi_montg_init(&mm, N)`.
 *         This is -N^-1 mod 2^CIL.
 *   T   - A bignum for temporary storage.
 *         It must be at least twice the limb size of N plus 2
 *         (T->n >= 2 * (N->n + 1)).
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static void mpi_montred(struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *N,
                        uint32_t mm,
                        const struct esp32c3_mpi_s *T)
{
  uint32_t z = 1;
  struct esp32c3_mpi_s U;

