apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  U.n = (int) z;
  U.s = (int) z;
  U.p = &z;

  mpi_montmul(A, &U, N, mm, T);
}

/****************************************************************************
 * Name: mpi_mult_mpi_overlong
 *
 * Description:
 *   Deal with the case when X & Y are too long for the hardware unit,
 *   by splitting one operand into two halves.
 *
 * Input Parameters:
 *   Z       - The destination MPI
 *   X       - The first factor
 *   Y       - The second factor
 *   y_words - The number of words to be process
 *   z_words - The number of words to be represented
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int mpi_mult_mpi_overlong(struct esp32c3_mpi_s *Z,
                                 const struct esp32c3_mpi_s *X,
                                 const struct esp32c3_mpi_s *Y,
                                 size_t y_words, size_t z_words)
{
  int ret = 0;
  struct esp32c3_mpi_s ztemp;

  /* Rather than slicing in two on bits we slice on limbs (32 bit words) */

  const size_t words_slice = y_words / 2;

  /* yp holds lower bits of Y */

  const struct esp32c3_mpi_s yp = {
    .p = Y->p,
    .n = words_slice,
    .s = Y->s
  };

  /* ypp holds upper bits of Y,
   * right shifted (also reuses Y's array contents)
   */

  const struct esp32c3_mpi_s ypp = {
    .p = Y->p + words_slice,
    .n = y_words - words_slice,
    .s = Y->s
  };

  esp32c3_mpi_init(&ztemp);

  /* Get result ztemp = yp * X (need temporary variable ztemp) */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&ztemp, X, &yp), cleanup);

  /* Z = ypp * Y */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(Z, X, &ypp), cleanup);

  /* Z = Z << b */

  ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(Z, words_slice * 32), cleanup);

  /* Z += ztemp */

  ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(Z, Z, &ztemp), cleanup);

cleanup:
  esp32c3_mpi_free(&ztemp);
  return ret;
}

/****************************************************************************
 * Name: mpi_mult_mpi_failover_mod_mult
 *
 * Description:
 *   Where we use hardware montgomery mod multiplication to calculate an
 *   esp32c3_mpi_mult_mpi result where either A or B are > 2048 bits
 *   so can't use the standard multiplication method.
 *
 * Input Parameters:
 *   Z       - The destination MPI
 *   X       - The first factor
 *   Y       - The second factor
 *   z_words - The number of words to be represented
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int mpi_mult_mpi_failover_mod_mult(struct esp32c3_mpi_s *Z,
                                          const struct esp32c3_mpi_s *X,
                                          const struct esp32c3_mpi_s *Y,
                                          size_t z_words)
{
  int ret;

  esp32c3_mpi_enable_hardware_hw_op();

  esp32c3_mpi_mult_failover_mod_op(X, Y, z_words);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(Z, z_words), cleanup);
  esp32c3_mpi_read_result_hw_op(Z, z_words);

  Z->s = X->s * Y->s;

cleanup:
  esp32c3_mpi_disable_hardware_hw_op();
  return ret;
}

/****************************************************************************
 * Name: esp32c3_bignum_clz
 *
 * Description:
 *   Count leading zero bits in a given integer
 *
 * Input Parameters:
 *   x       - The MPI context to query
 *
 * Returned Value:
 *   The count leading zero bits in a given integer.
 *
 ****************************************************************************/

static size_t esp32c3_bignum_clz(const uint32_t x)
{
  size_t j;
  uint32_t mask = UINT32_C(1) << (BIL - 1);

  for (j = 0; j < BIL; j++)
    {
      if (x & mask)
        {
          break;
        }

      mask >>= 1;
    }

  return j;
}

/****************************************************************************
 * Name: mpi_get_digit
 *
 * Description:
 *   Convert an ASCII character to digit value
 *
 * Input Parameters:
 *   d       - The destination MPI
 *   radix   - The numeric base of the input character
 *   c       - An ASCII character
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int mpi_get_digit(uint32_t *d, int radix, char c)
{
  *d = 255;

  if (c >= 0x30 && c <= 0x39)
    {
      *d = c - 0x30;
    }

  if (c >= 0x41 && c <= 0x46)
    {
      *d = c - 0x37;
    }

  if (c >= 0x61 && c <= 0x66)
    {
      *d = c - 0x57;
    }

  if (*d >= (uint32_t) radix)
    {
      return ESP32C3_ERR_MPI_INVALID_CHARACTER;
    }

  return OK;
}

/****************************************************************************
 * Name: mpi_write_hlp
 *
 * Description:
 *   Helper to write the digits high-order first
 *
 * Input Parameters:
 *   X       - The source MPI
 *   radix   - The numeric base of the output string
 *   p       - The buffer to write the string to
 *   buflen  - The available size in Bytes of p
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int mpi_write_hlp(struct esp32c3_mpi_s *X, int radix,
                         char **p, const size_t buflen)
{
  int ret;
  uint32_t r;
  size_t length = 0;
  char *p_end = *p + buflen;

  do
    {
      if (length >= buflen)
        {
          return ESP32C3_ERR_MPI_BUFFER_TOO_SMALL;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_mod_int(&r, X, radix), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_div_int(X, NULL, X, radix), cleanup);

      /* Write the residue in the current position, as an ASCII character.
       */

      if (r < 0xa)
        {
          *(--p_end) = (char)('0' + r);
        }
      else
        {
          *(--p_end) = (char)('A' + (r - 0xa));
        }

      length++;
    }
  while (esp32c3_mpi_cmp_int(X, 0) != 0);

  memmove(*p, p_end, length);
  *p += length;

cleanup:
  return ret;
}

/****************************************************************************
 * Name: mpi_uint_bigendian_to_host
 *
 * Description:
 *   Convert a big-endian byte array aligned to the size of uint32_t
 *   into the storage form used by esp32c3_mpi
 *
 * Input Parameters:
 *   X       - The MPI context to convert
 *
 * Returned Value:
 *   The size of uint32_t into the storage form used by esp32c3_mpi.
 *
 ****************************************************************************/

