apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
static uint32_t mpi_uint_bigendian_to_host(uint32_t x)
{
  uint8_t i;
  unsigned char *x_ptr;
  uint32_t tmp = 0;

  for (i = 0, x_ptr = (unsigned char *) &x; i < CIL; i++, x_ptr++)
    {
      tmp <<= CHAR_BIT;
      tmp |= (uint32_t) *x_ptr;
    }

  return (tmp);
}

/****************************************************************************
 * Name: mpi_bigendian_to_host
 *
 * Description:
 *   Enlarge an MPI to the specified number of limbs
 *
 * Input Parameters:
 *   p       - The MPI context to grow
 *   limbs   - The target number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static void mpi_bigendian_to_host(uint32_t * const p, size_t limbs)
{
  uint32_t *cur_limb_left;
  uint32_t *cur_limb_right;
  if (limbs == 0)
    {
      return;
    }

  /* Traverse limbs and
   * - adapt byte-order in each limb
   * - swap the limbs themselves.
   * For that, simultaneously traverse the limbs from left to right
   * and from right to left, as long as the left index is not bigger
   * than the right index (it's not a problem if limbs is odd and the
   * indices coincide in the last iteration).
   */

  for (cur_limb_left = p, cur_limb_right = p + (limbs - 1);
     cur_limb_left <= cur_limb_right;
     cur_limb_left++, cur_limb_right--)
    {
      uint32_t tmp;

      /* Note that if cur_limb_left == cur_limb_right,
       * this code effectively swaps the bytes only once.
       */

      tmp = mpi_uint_bigendian_to_host(*cur_limb_left);
      *cur_limb_left = mpi_uint_bigendian_to_host(*cur_limb_right);
      *cur_limb_right = tmp;
    }
}

/****************************************************************************
 * Name: ct_lt_mpi_uint
 *
 * Description:
 *   Decide if an integer is less than the other, without branches.
 *
 * Input Parameters:
 *   X       - First integer
 *   nblimbs - Second integer
 *
 * Returned Value:
 *   1 if \p x is less than \p y, 0 otherwise.
 *
 ****************************************************************************/

static unsigned ct_lt_mpi_uint(const uint32_t x,
                               const uint32_t y)
{
  uint32_t ret;
  uint32_t cond;

  /* Check if the most significant bits (MSB) of the operands are different.
   */

  cond = (x ^ y);

  /* If the MSB are the same then the difference x-y will be negative (and
   * have its MSB set to 1 during conversion to unsigned) if and only if x<y.
   */

  ret = (x - y) & ~cond;

  /* If the MSB are different, then the operand with the MSB of 1 is the
   * bigger. (That is if y has MSB of 1, then x<y is true and it is false if
   * the MSB of y is 0.)
   */

  ret |= y & cond;

  ret = ret >> (BIL - 1);

  return (unsigned) ret;
}

/****************************************************************************
 * Name: esp32c3_bignum_int_div_int
 *
 * Description:
 *   Unsigned integer divide - double uint32_t dividend, u1/u0, and
 *   uint32_t divisor, d
 *
 * Input Parameters:
 *   X       - The MPI context to grow
 *   nblimbs - The target number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static uint32_t esp32c3_bignum_int_div_int(uint32_t u1, uint32_t u0,
                                           uint32_t d, uint32_t *r)
{
  const uint32_t radix = (uint32_t) 1 << BIH;
  const uint32_t uint_halfword_mask = ((uint32_t) 1 << BIH) - 1;
  uint32_t d0;
  uint32_t d1;
  uint32_t q0;
  uint32_t q1;
  uint32_t rax;
  uint32_t r0;
  uint32_t quotient;
  uint32_t u0_msw;
  uint32_t u0_lsw;
  size_t s;

  /* Check for overflow */

  if (0 == d || u1 >= d)
    {
      if (r != NULL)
        {
          *r = ~0;
        }

      return (~0);
    }

  /* Algorithm D, Section 4.3.1 - The Art of Computer Programming
   *   Vol. 2 - Seminumerical Algorithms, Knuth
   */

  /* Normalize the divisor, d, and dividend, u0, u1
   */

  s = esp32c3_bignum_clz(d);
  d = d << s;

  u1 = u1 << s;
  u1 |= (u0 >> (BIL - s)) & (-(int32_t)s >> (BIL - 1));
  u0 =  u0 << s;

  d1 = d >> BIH;
  d0 = d & uint_halfword_mask;

  u0_msw = u0 >> BIH;
  u0_lsw = u0 & uint_halfword_mask;

  /* Find the first quotient and remainder
   */

  q1 = u1 / d1;
  r0 = u1 - d1 * q1;

  while (q1 >= radix || (q1 * d0 > radix * r0 + u0_msw))
    {
      q1 -= 1;
      r0 += d1;

      if (r0 >= radix)
        {
          break;
        }
    }

  rax = (u1 * radix) + (u0_msw - q1 * d);
  q0 = rax / d1;
  r0 = rax - q0 * d1;

  while (q0 >= radix || (q0 * d0 > radix * r0 + u0_lsw))
    {
      q0 -= 1;
      r0 += d1;

      if (r0 >= radix)
        {
          break;
        }
    }

  if (r != NULL)
    {
      *r = (rax * radix + u0_lsw - q0 * d) >> s;
    }

  quotient = q1 * radix + q0;

  return quotient;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_mpi_init
 *
 * Description:
 *   Initialize an MPI context
 *
 * Input Parameters:
 *   X      - The MPI context to initialize
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_mpi_init(struct esp32c3_mpi_s *X)
{
  DEBUGASSERT(X != NULL);

  X->s = 1;
  X->n = 0;
  X->p = NULL;
}

/****************************************************************************
 * Name: esp32c3_mpi_free
 *
 * Description:
 *   Frees the components of an MPI context
 *
 * Input Parameters:
 *   X      - The MPI context to be cleared
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_mpi_free(struct esp32c3_mpi_s *X)
{
  if (X == NULL)
    {
      return;
    }

  if (X->p != NULL)
    {
      esp32c3_mpi_zeroize(X->p, X->n);
      free(X->p);
    }

  X->s = 1;
  X->n = 0;
  X->p = NULL;
}

/****************************************************************************
 * Name: esp32c3_mpi_grow
 *
 * Description:
 *   Enlarge an MPI to the specified number of limbs
 *
 * Input Parameters:
 *   X       - The MPI context to grow
 *   nblimbs - The target number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_grow(struct esp32c3_mpi_s *X, size_t nblimbs)
{
  uint32_t *p;
  DEBUGASSERT(X != NULL);

  if (nblimbs > ESP32C3_MPI_MAX_LIMBS)
    {
      return ESP32C3_ERR_MPI_ALLOC_FAILED;
    }

  if (X->n < nblimbs)
    {
      if ((p = calloc(nblimbs, CIL)) == NULL)
        {
          return ESP32C3_ERR_MPI_ALLOC_FAILED;
        }

      if (X->p != NULL)
        {
          memcpy(p, X->p, X->n * CIL);
          esp32c3_mpi_zeroize(X->p, X->n);
          free(X->p);
        }

      X->n = nblimbs;
      X->p = p;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_shrink
 *
 * Description:
 *   Resizes an MPI downwards, keeping at least the specified number of limbs
 *
 * Input Parameters:
 *   X       - The MPI context to shrink
 *   nblimbs - The minimum number of limbs
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_shrink(struct esp32c3_mpi_s *X, size_t nblimbs)
{
  uint32_t *p;
  size_t i;
  DEBUGASSERT(X != NULL);

  if (nblimbs > ESP32C3_MPI_MAX_LIMBS)
    {
      return ESP32C3_ERR_MPI_ALLOC_FAILED;
    }

