apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  /* Actually resize up if there are currently fewer than nblimbs limbs. */

  if (X->n <= nblimbs)
    {
      return (esp32c3_mpi_grow(X, nblimbs));
    }

  /* After this point, then X->n > nblimbs and in particular X->n > 0. */

  for (i = X->n - 1; i > 0; i--)
    {
      if (X->p[i] != 0)
        {
          break;
        }
    }

  i++;

  if (i < nblimbs)
    {
      i = nblimbs;
    }

  if ((p = calloc(i, CIL)) == NULL)
    {
      return ESP32C3_ERR_MPI_ALLOC_FAILED;
    }

  if (X->p != NULL)
    {
      memcpy(p, X->p, i * CIL);
      esp32c3_mpi_zeroize(X->p, X->n);
      free(X->p);
    }

  X->n = i;
  X->p = p;

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_copy
 *
 * Description:
 *   Copy the contents of Y into X
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   Y       - The source MPI
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_copy(struct esp32c3_mpi_s *X,
                     const struct esp32c3_mpi_s *Y)
{
  int ret = 0;
  size_t i;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  if (X == Y)
    {
      return OK;
    }

  if (Y->n == 0)
    {
      esp32c3_mpi_free(X);
      return OK;
    }

  for (i = Y->n - 1; i > 0; i--)
    {
      if (Y->p[i] != 0)
        {
          break;
        }
    }

  i++;

  X->s = Y->s;

  if (X->n < i)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, i), cleanup);
    }
  else
    {
      memset(X->p + i, 0, (X->n - i) * CIL);
    }

  memcpy(X->p, Y->p, i * CIL);

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_swap
 *
 * Description:
 *   Swap the contents of X and Y
 *
 * Input Parameters:
 *   X       - The first MPI
 *   nblimbs - The second MPI
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_mpi_swap(struct esp32c3_mpi_s *X, struct esp32c3_mpi_s *Y)
{
  struct esp32c3_mpi_s T;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  memcpy(&T,  X, sizeof(struct esp32c3_mpi_s));
  memcpy(X,  Y, sizeof(struct esp32c3_mpi_s));
  memcpy(Y, &T, sizeof(struct esp32c3_mpi_s));
}

/****************************************************************************
 * Name: esp32c3_mpi_safe_cond_assign
 *
 * Description:
 *   Perform a safe conditional copy of MPI which doesn't
 *   reveal whether the condition was true or not.
 *
 * Input Parameters:
 *   X       - The MPI to conditionally assign to
 *   Y       - The MPI to be assigned from
 *   assign  - The condition deciding whether perform the assignment or not
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_safe_cond_assign(struct esp32c3_mpi_s *X,
                                 const struct esp32c3_mpi_s *Y,
                                 unsigned char assign)
{
  int ret = 0;
  size_t i;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  /* make sure assign is 0 or 1 in a time-constant manner */

  assign = (assign | (unsigned char)-assign) >> 7;

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, Y->n), cleanup);

  X->s = X->s * (1 - assign) + Y->s * assign;

  mpi_safe_cond_assign(Y->n, X->p, Y->p, assign);

  for (i = Y->n; i < X->n; i++)
    {
      X->p[i] *= (1 - assign);
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_safe_cond_swap
 *
 * Description:
 *   Perform a safe conditional swap which doesn't
 *   reveal whether the condition was true or not.
 *
 * Input Parameters:
 *   X       - The first MPI
 *   Y       - The second MPI
 *   swap    - The condition deciding whether to perform the swap or not
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_safe_cond_swap(struct esp32c3_mpi_s *X,
                               struct esp32c3_mpi_s *Y,
                               unsigned char swap)
{
  int ret;
  int s;
  size_t i;
  uint32_t tmp;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  if (X == Y)
    {
      return OK;
    }

  /* make sure swap is 0 or 1 in a time-constant manner */

  swap = (swap | (unsigned char)-swap) >> 7;

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, Y->n), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(Y, X->n), cleanup);

  s = X->s;
  X->s = X->s * (1 - swap) + Y->s * swap;
  Y->s = Y->s * (1 - swap) +  s * swap;

  for (i = 0; i < X->n; i++)
    {
      tmp = X->p[i];
      X->p[i] = X->p[i] * (1 - swap) + Y->p[i] * swap;
      Y->p[i] = Y->p[i] * (1 - swap) +   tmp * swap;
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_lset
 *
 * Description:
 *   Set value from integer
 *
 * Input Parameters:
 *   X       - The MPI to set
 *   z       - The value to use
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_lset(struct esp32c3_mpi_s *X, int32_t z)
{
  int ret;
  DEBUGASSERT(X != NULL);

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, 1), cleanup);
  memset(X->p, 0, X->n * CIL);

  X->p[0] = (z < 0) ? -z : z;
  X->s  = (z < 0) ? -1 : 1;

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_get_bit
 *
 * Description:
 *   Get a specific bit from an MPI
 *
 * Input Parameters:
 *   X       - The MPI context to query
 *   pos     - Zero-based index of the bit to query
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_get_bit(const struct esp32c3_mpi_s *X, size_t pos)
{
  DEBUGASSERT(X != NULL);

