apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  if (X->n * BIL <= pos)
    {
      return OK;
    }

  return ((X->p[pos / BIL] >> (pos % BIL)) & 0x01);
}

/****************************************************************************
 * Name: esp32c3_mpi_set_bit
 *
 * Description:
 *   Modify a specific bit in an MPI
 *
 * Input Parameters:
 *   X       - The MPI context to modify
 *   pos     - Zero-based index of the bit to modify
 *   val     - The desired value of bit
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_set_bit(struct esp32c3_mpi_s *X,
                        size_t pos, unsigned char val)
{
  int ret = 0;
  size_t off = pos / BIL;
  size_t idx = pos % BIL;
  DEBUGASSERT(X != NULL);

  if (val != 0 && val != 1)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  if (X->n * BIL <= pos)
    {
      if (val == 0)
        {
          return OK;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, off + 1), cleanup);
    }

  X->p[off] &= ~((uint32_t) 0x01 << idx);
  X->p[off] |= (uint32_t) val << idx;

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_lsb
 *
 * Description:
 *   Return the number of bits of value
 *
 * Input Parameters:
 *   X       - The MPI context to query
 *
 * Returned Value:
 *   The number of bits of value.
 *
 ****************************************************************************/

size_t esp32c3_mpi_lsb(const struct esp32c3_mpi_s *X)
{
  size_t i;
  size_t j;
  size_t count = 0;
  DEBUGASSERT(X != NULL);

  for (i = 0; i < X->n; i++)
    {
      for (j = 0; j < BIL; j++, count++)
        {
          if (((X->p[i] >> j) & 1) != 0)
            {
              return (count);
            }
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_bitlen
 *
 * Description:
 *   Return the number of bits up to and including the most
 *   significant bit of value
 *
 * Input Parameters:
 *   X       - The MPI context to query
 *
 * Returned Value:
 *   The number of bits up and including the most significant bit of value.
 *
 ****************************************************************************/

size_t esp32c3_mpi_bitlen(const struct esp32c3_mpi_s *X)
{
  size_t i;
  size_t j;

  if (X->n == 0)
    {
      return OK;
    }

  for (i = X->n - 1; i > 0; i--)
    {
      if (X->p[i] != 0)
        {
          break;
        }
    }

  j = BIL - esp32c3_bignum_clz(X->p[i]);

  return ((i * BIL) + j);
}

/****************************************************************************
 * Name: esp32c3_mpi_size
 *
 * Description:
 *   Return the total size of an MPI value in bytes
 *
 * Input Parameters:
 *   X       - The MPI context to query
 *
 * Returned Value:
 *   The least number of bytes capable of storing the absolute value.
 *
 ****************************************************************************/

size_t esp32c3_mpi_size(const struct esp32c3_mpi_s *X)
{
  return ((esp32c3_mpi_bitlen(X) + 7) >> 3);
}

/****************************************************************************
 * Name: esp32c3_mpi_read_string
 *
 * Description:
 *   Import from an ASCII string
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   radix   - The numeric base of the input string
 *   s       - Null-terminated string buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_read_string(struct esp32c3_mpi_s *X,
                            int radix, const char *s)
{
  int ret;
  size_t i;
  size_t j;
  size_t slen;
  size_t n;
  uint32_t d;
  struct esp32c3_mpi_s T;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(s != NULL);

  if (radix < 2 || radix > 16)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  esp32c3_mpi_init(&T);

  slen = strlen(s);

  if (radix == 16)
    {
      if (slen > MPI_SIZE_T_MAX >> 2)
        {
          return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
        }

      n = BITS_TO_LIMBS(slen << 2);

      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, n), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_lset(X, 0), cleanup);

      for (i = slen, j = 0; i > 0; i--, j++)
        {
          if (i == 1 && s[i - 1] == '-')
            {
              X->s = -1;
              break;
            }

          ESP32C3_MPI_CHK(mpi_get_digit(&d, radix, s[i - 1]), cleanup);
          X->p[j / (2 * CIL)] |= d << ((j % (2 * CIL)) << 2);
        }
    }
  else
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_lset(X, 0), cleanup);

      for (i = 0; i < slen; i++)
        {
          if (i == 0 && s[i] == '-')
            {
              X->s = -1;
              continue;
            }

          ESP32C3_MPI_CHK(mpi_get_digit(&d, radix, s[i]), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_mul_int(&T, X, radix), cleanup);

          if (X->s == 1)
            {
              ESP32C3_MPI_CHK(esp32c3_mpi_add_int(X, &T, d), cleanup);
            }
          else
            {
              ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(X, &T, d), cleanup);
            }
        }
    }

cleanup:
  esp32c3_mpi_free(&T);
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_write_string
 *
 * Description:
 *   Export an MPI to an ASCII string
 *
 * Input Parameters:
 *   X       - The source MPI
 *   radix   - The numeric base of the output string
 *   buf     - The buffer to write the string to
 *   buflen  - The available size in Bytes of buf
 *   olen    - The address at which to store the length of the string written
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_write_string(const struct esp32c3_mpi_s *X, int radix,
                             char *buf, size_t buflen, size_t *olen)
{
  int ret = 0;
  size_t n;
  char *p;
  struct esp32c3_mpi_s T;
  DEBUGASSERT(X  != NULL);
  DEBUGASSERT(olen != NULL);
  DEBUGASSERT(buflen == 0 || buf != NULL);

