apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  if (radix < 2 || radix > 16)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  /* Number of bits necessary to present `n`. */

  n = esp32c3_mpi_bitlen(X);
  if (radix >=  4)
    {
      /* Number of 4-adic digits necessary to present
       * `n`. If radix > 4, this might be a strict
       * overapproximation of the number of
       * radix-adic digits needed to present `n`.
       */

      n >>= 1;
    }

  if (radix >= 16)
    {
      /* Number of hexadecimal digits necessary to
       * present `n`.
       */

      n >>= 1;
    }

  /* Terminating null byte */

  n += 1;

  /* Compensate for the divisions above, which round down `n`
   * in case it's not even.
   */

  n += 1;

  /* Potential '-'-sign. */

  n += 1;

  /* Make n even to have enough space for hexadecimal writing,
   * which always uses an even number of hex-digits.
   */

  n += (n & 1);

  if (buflen < n)
    {
      *olen = n;
      return ESP32C3_ERR_MPI_BUFFER_TOO_SMALL;
    }

  p = buf;
  esp32c3_mpi_init(&T);

  if (X->s == -1)
    {
      *p++ = '-';
      buflen--;
    }

  if (radix == 16)
    {
      int c;
      size_t i;
      size_t j;
      size_t k;

      for (i = X->n, k = 0; i > 0; i--)
        {
          for (j = CIL; j > 0; j--)
            {
              c = (X->p[i - 1] >> ((j - 1) << 3)) & 0xff;

              if (c == 0 && k == 0 && (i + j) != 2)
                {
                  continue;
                }

              *(p++) = "0123456789ABCDEF" [c / 16];
              *(p++) = "0123456789ABCDEF" [c % 16];
              k = 1;
            }
        }
    }
  else
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(&T, X), cleanup);

      if (T.s == -1)
        {
          T.s = 1;
        }

      ESP32C3_MPI_CHK(mpi_write_hlp(&T, radix, &p, buflen), cleanup);
    }

  *p++ = '\0';
  *olen = p - buf;

cleanup:
  esp32c3_mpi_free(&T);
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_read_binary
 *
 * Description:
 *   Import an MPI from unsigned big endian binary data
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   buf     - The input buffer
 *   buflen  - The length of the input buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_read_binary(struct esp32c3_mpi_s *X,
                            const unsigned char *buf,
                            size_t buflen)
{
  int ret;
  size_t const limbs  = CHARS_TO_LIMBS(buflen);
  size_t const overhead = (limbs * CIL) - buflen;
  unsigned char *XP;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(buflen == 0 || buf != NULL);

  /* Ensure that target MPI has exactly the necessary number of limbs */

  if (X->n != limbs)
    {
      esp32c3_mpi_free(X);
      esp32c3_mpi_init(X);
      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, limbs), cleanup);
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_lset(X, 0), cleanup);

  /* Avoid calling `memcpy` with NULL source argument,
   * even if buflen is 0.
   */

  if (buf != NULL)
    {
      XP = (unsigned char *) X->p;
      memcpy(XP + overhead, buf, buflen);

      mpi_bigendian_to_host(X->p, limbs);
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_write_binary
 *
 * Description:
 *   Export X into unsigned binary data, big endian
 *
 * Input Parameters:
 *   X       - The source MPI
 *   buf     - The output buffer
 *   buflen  - The length of the output buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_write_binary(const struct esp32c3_mpi_s *X,
                unsigned char *buf, size_t buflen)
{
  size_t stored_bytes;
  size_t bytes_to_copy;
  unsigned char *p;
  size_t i;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(buflen == 0 || buf != NULL);

  stored_bytes = X->n * CIL;

  if (stored_bytes < buflen)
    {
      /* There is enough space in the output buffer. Write initial
       * null bytes and record the position at which to start
       * writing the significant bytes. In this case, the execution
       * trace of this function does not depend on the value of the
       * number.
       */

      bytes_to_copy = stored_bytes;
      p = buf + buflen - stored_bytes;
      memset(buf, 0, buflen - stored_bytes);
    }
  else
    {
      /* The output buffer is smaller than the allocated size of X.
       * However X may fit if its leading bytes are zero.
       */

      bytes_to_copy = buflen;
      p = buf;
      for (i = bytes_to_copy; i < stored_bytes; i++)
        {
          if (GET_BYTE(X, i) != 0)
            {
              return ESP32C3_ERR_MPI_BUFFER_TOO_SMALL;
            }
        }
    }

  for (i = 0; i < bytes_to_copy; i++)
    {
      p[bytes_to_copy - i - 1] = GET_BYTE(X, i);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_shift_l
 *
 * Description:
 *   Perform a left-shift on an MPI: X <<= count
 *
 * Input Parameters:
 *   X       - The MPI to shift
 *   count   - The number of bits to shift by
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_shift_l(struct esp32c3_mpi_s *X, size_t count)
{
  int ret;
  size_t i;
  size_t v0;
  size_t t1;
  uint32_t r0 = 0;
  uint32_t r1;
  DEBUGASSERT(X != NULL);

  v0 = count / (BIL);
  t1 = count & (BIL - 1);

  i = esp32c3_mpi_bitlen(X) + count;

  if (X->n * BIL < i)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, BITS_TO_LIMBS(i)), cleanup);
    }

  ret = 0;

  /* shift by count / limb_size */

  if (v0 > 0)
    {
      for (i = X->n; i > v0; i--)
        X->p[i - 1] = X->p[i - v0 - 1];

      for (; i > 0; i--)
        X->p[i - 1] = 0;
    }

  /* shift by count % limb_size
   */

  if (t1 > 0)
    {
      for (i = v0; i < X->n; i++)
        {
          r1 = X->p[i] >> (BIL - t1);
          X->p[i] <<= t1;
          X->p[i] |= r0;
          r0 = r1;
        }
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_shift_r
 *
 * Description:
 *   Perform a right-shift on an MPI: X >>= count
 *
 * Input Parameters:
 *   X       - The MPI to shift
 *   count   - The number of bits to shift by
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_shift_r(struct esp32c3_mpi_s *X, size_t count)
{
  size_t i;
  size_t v0;
  size_t v1;
  uint32_t r0 = 0;
  uint32_t r1;
  DEBUGASSERT(X != NULL);

