apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  v0 = count /  BIL;
  v1 = count & (BIL - 1);

  if (v0 > X->n || (v0 == X->n && v1 > 0))
    {
      return esp32c3_mpi_lset(X, 0);
    }

  /* shift by count / limb_size
   */

  if (v0 > 0)
    {
      for (i = 0; i < X->n - v0; i++)
        {
          X->p[i] = X->p[i + v0];
        }

      for (; i < X->n; i++)
        {
          X->p[i] = 0;
        }
    }

  /* shift by count % limb_size
   */

  if (v1 > 0)
    {
      for (i = X->n; i > 0; i--)
        {
          r1 = X->p[i - 1] << (BIL - v1);
          X->p[i - 1] >>= v1;
          X->p[i - 1] |= r0;
          r0 = r1;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_cmp_abs
 *
 * Description:
 *   Compare the absolute values of two MPIs
 *
 * Input Parameters:
 *   X       - The left-hand MPI
 *   Y       - The right-hand MPI
 *
 * Returned Value:
 *   1 if \p `|X|` is greater than \p `|Y|`.
 *   -1 if \p `|X|` is lesser than \p `|Y|`.
 *   0 if \p `|X|` is equal to \p `|Y|`.
 *
 ****************************************************************************/

int esp32c3_mpi_cmp_abs(const struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *Y)
{
  size_t i;
  size_t j;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  for (i = X->n; i > 0; i--)
    {
      if (X->p[i - 1] != 0)
        {
          break;
        }
    }

  for (j = Y->n; j > 0; j--)
    {
      if (Y->p[j - 1] != 0)
        {
          break;
        }
    }

  if (i == 0 && j == 0)
    {
      return OK;
    }

  if (i > j)
    {
      return (1);
    }

  if (j > i)
    {
      return (-1);
    }

  for (; i > 0; i--)
    {
      if (X->p[i - 1] > Y->p[i - 1])
        {
          return (1);
        }

      if (X->p[i - 1] < Y->p[i - 1])
        {
          return (-1);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_cmp_mpi
 *
 * Description:
 *   Compare two MPIs.
 *
 * Input Parameters:
 *   X       - The left-hand MPI
 *   Y       - The right-hand MPI
 *
 * Returned Value:
 *   1 if \p `X` is greater than \p `Y`.
 *   -1 if \p `X` is lesser than \p `Y`.
 *   0 if \p `X` is equal to \p `Y`.
 *
 ****************************************************************************/

int esp32c3_mpi_cmp_mpi(const struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *Y)
{
  size_t i;
  size_t j;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);

  for (i = X->n; i > 0; i--)
    {
      if (X->p[i - 1] != 0)
        {
          break;
        }
    }

  for (j = Y->n; j > 0; j--)
    {
      if (Y->p[j - 1] != 0)
        {
          break;
        }
    }

  if (i == 0 && j == 0)
    {
      return OK;
    }

  if (i > j)
    {
      return (X->s);
    }

  if (j > i)
    {
      return (-Y->s);
    }

  if (X->s > 0 && Y->s < 0)
    {
      return (1);
    }

  if (Y->s > 0 && X->s < 0)
    {
      return (-1);
    }

  for (; i > 0; i--)
    {
      if (X->p[i - 1] > Y->p[i - 1])
        {
          return (X->s);
        }

      if (X->p[i - 1] < Y->p[i - 1])
        {
          return (-X->s);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_lt_mpi_ct
 *
 * Description:
 *   Check if an MPI is less than the other in constant time
 *
 * Input Parameters:
 *   X       - The left-hand MPI
 *   Y       - The right-hand MPI
 *   ret     - The result of the comparison:
 *             1 if \p X is less than \p Y.
 *             0 if \p X is greater than or equal to \p Y.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_lt_mpi_ct(const struct esp32c3_mpi_s *X,
                          const struct esp32c3_mpi_s *Y,
                          unsigned *ret)
{
  size_t i;

  /* The value of any of these variables is either 0 or 1 at all times. */

  unsigned cond;
  unsigned done;
  unsigned x_is_negative;
  unsigned y_is_negative;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(Y != NULL);
  DEBUGASSERT(ret != NULL);

  if (X->n != Y->n)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  /* Set sign_N to 1 if N >= 0, 0 if N < 0.
   * We know that N->s == 1 if N >= 0 and N->s == -1 if N < 0.
   */

  x_is_negative = (X->s & 2) >> 1;
  y_is_negative = (Y->s & 2) >> 1;

  /* If the signs are different, then the positive operand is the bigger.
   * That is if X is negative (x_is_negative == 1), then X < Y is true and it
   * is false if X is positive (x_is_negative == 0).
   */

  cond = (x_is_negative ^ y_is_negative);
  *ret = cond & x_is_negative;

  /* This is a constant-time function. We might have the result, but we still
   * need to go through the loop. Record if we have the result already.
   */

  done = cond;

  for (i = X->n; i > 0; i--)
    {
      /* If Y->p[i - 1] < X->p[i - 1] then X < Y is true if and only if both
       * X and Y are negative.
       *
       * Again even if we can make a decision, we just mark the result and
       * the fact that we are done and continue looping.
       */

      cond = ct_lt_mpi_uint(Y->p[i - 1], X->p[i - 1]);
      *ret |= cond & (1 - done) & x_is_negative;
      done |= cond;

      /* If X->p[i - 1] < Y->p[i - 1] then X < Y is true if and only if both
       * X and Y are positive.
       *
       * Again even if we can make a decision, we just mark the result and
       * the fact that we are done and continue looping.
       */

      cond = ct_lt_mpi_uint(X->p[i - 1], Y->p[i - 1]);
      *ret |= cond & (1 - done) & (1 - x_is_negative);
      done |= cond;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_cmp_int
 *
 * Description:
 *   Compare an MPI with an integer
 *
 * Input Parameters:
 *   X       - The left-hand MPI
 *   z       - The integer value to compare \p X to
 *
 * Returned Value:
 *   \c 1 if \p X is greater than \p z.
 *   \c -1 if \p X is lesser than \p z.
 *   \c 0 if \p X is equal to \p z.
 *
 ****************************************************************************/

int esp32c3_mpi_cmp_int(const struct esp32c3_mpi_s *X, int32_t z)
{
  struct esp32c3_mpi_s Y;
  uint32_t p[1];
  DEBUGASSERT(X != NULL);

  *p  = (z < 0) ? -z : z;
  Y.s = (z < 0) ? -1 : 1;
  Y.n = 1;
  Y.p = p;

  return (esp32c3_mpi_cmp_mpi(X, &Y));
}

/****************************************************************************
 * Name: esp32c3_mpi_add_abs
 *
 * Description:
 *   Perform an unsigned addition of MPIs: X = |A| + |B|
 *
 * Input Parameters:
 *   X       - The left-hand MPI
 *   z       - The integer value to compare \p X to.
 *
 * Returned Value:
 *   \c 1 if \p X is greater than \p z.
 *   \c -1 if \p X is lesser than \p z.
 *   \c 0 if \p X is equal to \p z.
 *
 ****************************************************************************/

int esp32c3_mpi_add_abs(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  int ret;
  size_t i;
  size_t j;
  uint32_t *o;
  uint32_t *p;
  uint32_t c;
  uint32_t tmp;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

