apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  if (X == B)
    {
      const struct esp32c3_mpi_s *T = A; A = X; B = T;
    }

  if (X != A)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(X, A), cleanup);
    }

  /* X should always be positive as a result of unsigned additions.
   */

  X->s = 1;

  for (j = B->n; j > 0; j--)
    {
      if (B->p[j - 1] != 0)
        {
          break;
        }
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, j), cleanup);

  o = B->p; p = X->p; c = 0;

  /* tmp is used because it might happen that p == o
   */

  for (i = 0; i < j; i++, o++, p++)
    {
      tmp = *o;
      *p += c; c = (*p < c);
      *p += tmp; c += (*p < tmp);
    }

  while (c != 0)
    {
      if (i >= X->n)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, i + 1), cleanup);
          p = X->p + i;
        }

      *p += c; c = (*p < c); i++; p++;
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_sub_abs
 *
 * Description:
 *   Perform an unsigned subtraction of MPIs: X = |A| - |B|
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The minuend
 *   B       - The subtrahend
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_sub_abs(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  struct esp32c3_mpi_s TB;
  int ret;
  size_t n;
  uint32_t carry;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  esp32c3_mpi_init(&TB);

  if (X == B)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TB, B), cleanup);
      B = &TB;
    }

  if (X != A)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(X, A), cleanup);
    }

  /* X should always be positive as a result of unsigned subtractions. */

  X->s = 1;

  ret = 0;

  for (n = B->n; n > 0; n--)
    {
      if (B->p[n - 1] != 0)
        {
          break;
        }
    }

  carry = mpi_sub_hlp(n, X->p, B->p);
  if (carry != 0)
    {
      /* Propagate the carry to the first nonzero limb of X. */

      for (; n < X->n && X->p[n] == 0; n++)
        {
          --X->p[n];
        }

      /* If we ran out of space for the carry, it means that the result
       * is negative.
       */

      if (n == X->n)
        {
          ret = ESP32C3_ERR_MPI_NEGATIVE_VALUE;
          goto cleanup;
        }

      --X->p[n];
    }

cleanup:
  esp32c3_mpi_free(&TB);
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_add_mpi
 *
 * Description:
 *   Perform a signed addition of MPIs: X = A + B
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The first summand
 *   B       - The second summand
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_add_mpi(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  int ret;
  int s;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  s = A->s;
  if (A->s * B->s < 0)
    {
      if (esp32c3_mpi_cmp_abs(A, B) >= 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(X, A, B), cleanup);
          X->s =  s;
        }
      else
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(X, B, A), cleanup);
          X->s = -s;
        }
    }
  else
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_add_abs(X, A, B), cleanup);
      X->s = s;
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_sub_mpi
 *
 * Description:
 *   Perform a signed subtraction of MPIs: X = A - B
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The minuend
 *   B       - The subtrahend
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_sub_mpi(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  int ret;
  int s;
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  s = A->s;
  if (A->s * B->s > 0)
    {
      if (esp32c3_mpi_cmp_abs(A, B) >= 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(X, A, B), cleanup);
          X->s =  s;
        }
      else
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(X, B, A), cleanup);
          X->s = -s;
        }
    }
  else
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_add_abs(X, A, B), cleanup);
      X->s = s;
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_add_int
 *
 * Description:
 *   Perform a signed addition of an MPI and an integer: X = A + b
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The first summand
 *   b       - The second summand
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_add_int(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        int32_t b)
{
  struct esp32c3_mpi_s _B;
  uint32_t p[1];
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);

  p[0] = (b < 0) ? -b : b;
  _B.s = (b < 0) ? -1 : 1;
  _B.n = 1;
  _B.p = p;

  return (esp32c3_mpi_add_mpi(X, A, &_B));
}

/****************************************************************************
 * Name: esp32c3_mpi_sub_int
 *
 * Description:
 *   Perform a signed subtraction of an MPI and an integer: X = A - b
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The minuend
 *   b       - The subtrahend
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_sub_int(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        int32_t b)
{
  struct esp32c3_mpi_s _B;
  uint32_t p[1];
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);

  p[0] = (b < 0) ? -b : b;
  _B.s = (b < 0) ? -1 : 1;
  _B.n = 1;
  _B.p = p;

