apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  return (esp32c3_mpi_sub_mpi(X, A, &_B));
}

/****************************************************************************
 * Name: esp32c3_mpi_mul_mpi
 *
 * Description:
 *   Perform a multiplication of two MPIs: Z = X * Y
 *
 * Input Parameters:
 *   Z      - The destination MPI
 *   X      - The first factor
 *   Y      - The second factor
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_mul_mpi(struct esp32c3_mpi_s *Z,
                        const struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *Y)
{
  int ret = 0;
  size_t x_bits = esp32c3_mpi_bitlen(X);
  size_t y_bits = esp32c3_mpi_bitlen(Y);
  size_t x_words = bits_to_words(x_bits);
  size_t y_words = bits_to_words(y_bits);
  size_t z_words = bits_to_words(x_bits + y_bits);
  size_t hw_words = MAX(x_words, y_words);

  /* Short-circuit eval if either argument is 0 or 1.

   * This is needed as the mpi modular division
   * argument will sometimes call in here when one
   * argument is too large for the hardware unit, but the other
   * argument is zero or one.
   */

  if (x_bits == 0 || y_bits == 0)
    {
      esp32c3_mpi_lset(Z, 0);
      return 0;
    }

  if (x_bits == 1)
    {
      ret = esp32c3_mpi_copy(Z, Y);
      Z->s *= X->s;
      return ret;
    }

  if (y_bits == 1)
    {
      ret = esp32c3_mpi_copy(Z, X);
      Z->s *= Y->s;
      return ret;
    }

  /* Grow Z to result size early, avoid interim allocations */

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(Z, z_words), cleanup);

  /* If factor is over 2048 bits, we can't use the standard
   * hardware multiplier
   */

  if (hw_words * 32 > SOC_RSA_MAX_BIT_LEN / 2)
    {
      if (z_words * 32 <= SOC_RSA_MAX_BIT_LEN)
        {
          return mpi_mult_mpi_failover_mod_mult(Z, X, Y, z_words);
        }
      else
        {
          /* Still too long for the hardware unit... */

          if (y_words > x_words)
            {
              return mpi_mult_mpi_overlong(Z, X, Y, y_words, z_words);
            }
          else
            {
              return mpi_mult_mpi_overlong(Z, Y, X, x_words, z_words);
            }
        }
    }

  /* Otherwise, we can use the (faster) multiply hardware unit */

  esp32c3_mpi_enable_hardware_hw_op();

  esp32c3_mpi_mul_mpi_hw_op(X, Y, hw_words);
  esp32c3_mpi_read_result_hw_op(Z, z_words);

  esp32c3_mpi_disable_hardware_hw_op();

  Z->s = X->s * Y->s;

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_mul_int
 *
 * Description:
 *   Perform a multiplication of an MPI with an unsigned integer: X = A * b
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The first factor
 *   b       - The second factor.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_mul_int(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        uint32_t b)
{
  struct esp32c3_mpi_s _B;
  uint32_t p[1];
  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);

  _B.s = 1;
  _B.n = 1;
  _B.p = p;
  p[0] = b;

  return (esp32c3_mpi_mul_mpi(X, A, &_B));
}

/****************************************************************************
 * Name: esp32c3_mpi_div_mpi
 *
 * Description:
 *   Perform a division with remainder of two MPIs: A = Q * B + R
 *
 * Input Parameters:
 *   Q        - The destination MPI for the quotient
 *   R        - The destination MPI for the remainder value
 *   A        - The dividend
 *   B        - The divisor
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_div_mpi(struct esp32c3_mpi_s *Q,
                        struct esp32c3_mpi_s *R,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  int ret;
  size_t i;
  size_t n;
  size_t t;
  size_t k;
  struct esp32c3_mpi_s X;
  struct esp32c3_mpi_s Y;
  struct esp32c3_mpi_s Z;
  struct esp32c3_mpi_s T1;
  struct esp32c3_mpi_s T2;
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  if (esp32c3_mpi_cmp_int(B, 0) == 0)
    {
      return ESP32C3_ERR_MPI_DIVISION_BY_ZERO;
    }

  esp32c3_mpi_init(&X);
  esp32c3_mpi_init(&Y);
  esp32c3_mpi_init(&Z);
  esp32c3_mpi_init(&T1);
  esp32c3_mpi_init(&T2);

  if (esp32c3_mpi_cmp_abs(A, B) < 0)
    {
      if (Q != NULL)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_lset(Q, 0), cleanup);
        }

      if (R != NULL)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_copy(R, A), cleanup);
        }

      return OK;
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&X, A), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&Y, B), cleanup);
  X.s = Y.s = 1;

  ESP32C3_MPI_CHK(esp32c3_mpi_grow(&Z, A->n + 2), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_lset(&Z,  0), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(&T1, 2), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(&T2, 3), cleanup);

  k = esp32c3_mpi_bitlen(&Y) % BIL;
  if (k < BIL - 1)
    {
      k = BIL - 1 - k;
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&X, k), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&Y, k), cleanup);
    }
  else
    {
      k = 0;
    }

  n = X.n - 1;
  t = Y.n - 1;
  ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&Y, BIL * (n - t)), cleanup);

  while (esp32c3_mpi_cmp_mpi(&X, &Y) >= 0)
    {
      Z.p[n - t]++;
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&X, &X, &Y), cleanup);
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&Y, BIL * (n - t)), cleanup);

  for (i = n; i > t ; i--)
    {
      if (X.p[i] >= Y.p[t])
        {
          Z.p[i - t - 1] = ~0;
        }
      else
        {
          Z.p[i - t - 1] = esp32c3_bignum_int_div_int(X.p[i], X.p[i - 1],
                                                      Y.p[t], NULL);
        }

      Z.p[i - t - 1]++;
      do
        {
          Z.p[i - t - 1]--;

          ESP32C3_MPI_CHK(esp32c3_mpi_lset(&T1, 0), cleanup);
          T1.p[0] = (t < 1) ? 0 : Y.p[t - 1];
          T1.p[1] = Y.p[t];
          ESP32C3_MPI_CHK(esp32c3_mpi_mul_int(&T1, &T1, Z.p[i - t - 1]),
                          cleanup);

