apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
          ESP32C3_MPI_CHK(esp32c3_mpi_lset(&T2, 0), cleanup);
          T2.p[0] = (i < 2) ? 0 : X.p[i - 2];
          T2.p[1] = (i < 1) ? 0 : X.p[i - 1];
          T2.p[2] = X.p[i];
        }
      while (esp32c3_mpi_cmp_mpi(&T1, &T2) > 0);

      ESP32C3_MPI_CHK(esp32c3_mpi_mul_int(&T1, &Y, Z.p[i - t - 1]), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&T1,  BIL * (i - t - 1)), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&X, &X, &T1), cleanup);

      if (esp32c3_mpi_cmp_int(&X, 0) < 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_copy(&T1, &Y), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&T1, BIL * (i - t - 1)),
                          cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&X, &X, &T1), cleanup);
          Z.p[i - t - 1]--;
        }
    }

  if (Q != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(Q, &Z), cleanup);
      Q->s = A->s * B->s;
    }

  if (R != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&X, k), cleanup);
      X.s = A->s;
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(R, &X), cleanup);

      if (esp32c3_mpi_cmp_int(R, 0) == 0)
        {
          R->s = 1;
        }
    }

cleanup:
  esp32c3_mpi_free(&X); esp32c3_mpi_free(&Y); esp32c3_mpi_free(&Z);
  esp32c3_mpi_free(&T1); esp32c3_mpi_free(&T2);

  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_div_int
 *
 * Description:
 *   Perform a division with remainder of an MPI by an integer: A = Q * b + R
 *
 * Input Parameters:
 *   Q        - The destination MPI for the quotient
 *   R        - The destination MPI for the remainder value
 *   A        - The dividend
 *   B        - The divisor
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_div_int(struct esp32c3_mpi_s *Q,
                        struct esp32c3_mpi_s *R,
                        const struct esp32c3_mpi_s *A,
                        int32_t b)
{
  struct esp32c3_mpi_s _B;
  uint32_t p[1];
  DEBUGASSERT(A != NULL);

  p[0] = (b < 0) ? -b : b;
  _B.s = (b < 0) ? -1 : 1;
  _B.n = 1;
  _B.p = p;

  return (esp32c3_mpi_div_mpi(Q, R, A, &_B));
}

/****************************************************************************
 * Name: esp32c3_mpi_mod_mpi
 *
 * Description:
 *   erform a modular reduction. R = A mod B
 *
 * Input Parameters:
 *   R       - The destination MPI for the residue value
 *   A       - The MPI to compute the residue of
 *   B       - The base of the modular reduction
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_mod_mpi(struct esp32c3_mpi_s *R,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *B)
{
  int ret;
  DEBUGASSERT(R != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  if (esp32c3_mpi_cmp_int(B, 0) < 0)
    {
      return ESP32C3_ERR_MPI_NEGATIVE_VALUE;
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_div_mpi(NULL, R, A, B), cleanup);

  while (esp32c3_mpi_cmp_int(R, 0) < 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(R, R, B), cleanup);
    }

  while (esp32c3_mpi_cmp_mpi(R, B) >= 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(R, R, B), cleanup);
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_mod_int
 *
 * Description:
 *   Perform a modular reduction with respect to an integer: r = A mod b
 *
 * Input Parameters:
 *   r       - The address at which to store the residue
 *   A       - The MPI to compute the residue of
 *   b       - The integer base of the modular reduction
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_mod_int(uint32_t *r,
                        const struct esp32c3_mpi_s *A, int32_t b)
{
  size_t i;
  uint32_t x;
  uint32_t y;
  uint32_t z;

  DEBUGASSERT(r != NULL);
  DEBUGASSERT(A != NULL);

  if (b == 0)
    {
      return ESP32C3_ERR_MPI_DIVISION_BY_ZERO;
    }

  if (b < 0)
    {
      return ESP32C3_ERR_MPI_NEGATIVE_VALUE;
    }

  /* handle trivial cases */

  if (b == 1)
    {
      *r = 0;
      return OK;
    }

  if (b == 2)
    {
      *r = A->p[0] & 1;
      return OK;
    }

  /* general case */

  for (i = A->n, y = 0; i > 0; i--)
    {
      x  = A->p[i - 1];
      y  = (y << BIH) | (x >> BIH);
      z  = y / b;
      y -= z * b;

      x <<= BIH;
      y  = (y << BIH) | (x >> BIH);
      z  = y / b;
      y -= z * b;
    }

  /* If A is negative, then the current y represents a negative value.
   * Flipping it to the positive side.
   */

  if (A->s < 0 && y != 0)
    {
      y = b - y;
    }

  *r = y;

  return OK;
}

/****************************************************************************
 * Name: esp32c3_mpi_exp_mod
 *
 * Description:
 *   Perform a sliding-window exponentiation: X = A^E mod N
 *
 * Input Parameters:
 *   X       - The destination MPI
 *   A       - The base of the exponentiation
 *   E       - The exponent MPI
 *   N       - The base for the modular reduction
 *   _RR     - A helper MPI depending solely on \p N which can be used to
 *             speed-up multiple modular exponentiations for the same value
 *             of \p N.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_exp_mod(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *E,
                        const struct esp32c3_mpi_s *N,
                        struct esp32c3_mpi_s *_RR)
{
  int ret;
  size_t wbits;
  size_t wsize;
  size_t one = 1;
  size_t i;
  size_t j;
  size_t nblimbs;
  size_t bufsize;
  size_t nbits;
  uint32_t ei;
  uint32_t mm;
  uint32_t state;
  struct esp32c3_mpi_s RR;
  struct esp32c3_mpi_s T;
  struct esp32c3_mpi_s W[1 << ESP32C3_MPI_WINDOW_SIZE];
  struct esp32c3_mpi_s apos;
  int neg;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(E != NULL);
  DEBUGASSERT(N != NULL);

  if (esp32c3_mpi_cmp_int(N, 0) <= 0 || (N->p[0] & 1) == 0)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  if (esp32c3_mpi_cmp_int(E, 0) < 0)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  if (esp32c3_mpi_bitlen(E) > ESP32C3_MPI_MAX_BITS ||
      esp32c3_mpi_bitlen(N) > ESP32C3_MPI_MAX_BITS)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  /* Init temps and window size
   */

  mpi_montg_init(&mm, N);
  esp32c3_mpi_init(&RR); esp32c3_mpi_init(&T);
  esp32c3_mpi_init(&apos);
  memset(W, 0, sizeof(W));

