apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  i = esp32c3_mpi_bitlen(E);

  wsize = (i > 671) ? 6 : (i > 239) ? 5 :
      (i >  79) ? 4 : (i >  23) ? 3 : 1;

#if (ESP32C3_MPI_WINDOW_SIZE < 6)
  if (wsize > ESP32C3_MPI_WINDOW_SIZE)
    {
      wsize = ESP32C3_MPI_WINDOW_SIZE;
    }
#endif

  j = N->n + 1;
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, j), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(&W[1],  j), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_grow(&T, j * 2), cleanup);

  /* Compensate for negative A (and correct at the end) */

  neg = (A->s == -1);
  if (neg)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(&apos, A), cleanup);
      apos.s = 1;
      A = &apos;
    }

  /* If 1st call, pre-compute R^2 mod N */

  if (_RR == NULL || _RR->p == NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_lset(&RR, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&RR, N->n * 2 * BIL), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&RR, &RR, N), cleanup);

      if (_RR != NULL)
        {
          memcpy(_RR, &RR, sizeof(struct esp32c3_mpi_s));
        }
    }
  else
    {
      memcpy(&RR, _RR, sizeof(struct esp32c3_mpi_s));
    }

  /* W[1] = A * R^2 * R^-1 mod N = A * R mod N */

  if (esp32c3_mpi_cmp_mpi(A, N) >= 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&W[1], A, N), cleanup);
    }
  else
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(&W[1], A), cleanup);
    }

  mpi_montmul(&W[1], &RR, N, mm, &T);

  /* X = R^2 * R^-1 mod N = R mod N */

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(X, &RR), cleanup);
  mpi_montred(X, N, mm, &T);

  if (wsize > 1)
    {
      /* W[1 << (wsize - 1)] = W[1] ^ (wsize - 1) */

      j =  one << (wsize - 1);

      ESP32C3_MPI_CHK(esp32c3_mpi_grow(&W[j], N->n + 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_copy(&W[j], &W[1]), cleanup);

      for (i = 0; i < wsize - 1; i++)
        {
          mpi_montmul(&W[j], &W[j], N, mm, &T);
        }

      /* W[i] = W[i - 1] * W[1] */

      for (i = j + 1; i < (one << wsize); i++)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_grow(&W[i], N->n + 1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_copy(&W[i], &W[i - 1]), cleanup);

          mpi_montmul(&W[i], &W[1], N, mm, &T);
        }
    }

  nblimbs = E->n;
  bufsize = 0;
  nbits   = 0;
  wbits   = 0;
  state   = 0;

  while (1)
    {
      if (bufsize == 0)
        {
          if (nblimbs == 0)
            {
              break;
            }

          nblimbs--;

          bufsize = sizeof(uint32_t) << 3;
        }

      bufsize--;

      ei = (E->p[nblimbs] >> bufsize) & 1;

      /* skip leading 0s */

      if (ei == 0 && state == 0)
        {
          continue;
        }

      if (ei == 0 && state == 1)
        {
          /* out of window, square X */

          mpi_montmul(X, X, N, mm, &T);
          continue;
        }

      /* add ei to current window */

      state = 2;

      nbits++;
      wbits |= (ei << (wsize - nbits));

      if (nbits == wsize)
        {
          /* X = X^wsize R^-1 mod N */

          for (i = 0; i < wsize; i++)
            {
              mpi_montmul(X, X, N, mm, &T);
            }

          /* X = X * W[wbits] R^-1 mod N */

          mpi_montmul(X, &W[wbits], N, mm, &T);

          state--;
          nbits = 0;
          wbits = 0;
        }
    }

  /* process the remaining bits */

  for (i = 0; i < nbits; i++)
    {
      mpi_montmul(X, X, N, mm, &T);

      wbits <<= 1;

      if ((wbits & (one << wsize)) != 0)
        mpi_montmul(X, &W[1], N, mm, &T);
    }

  /* X = A^E * R * R^-1 mod N = A^E mod N */

  mpi_montred(X, N, mm, &T);

  if (neg && E->n != 0 && (E->p[0] & 1) != 0)
    {
      X->s = -1;
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(X, N, X), cleanup);
    }

cleanup:
  for (i = (one << (wsize - 1)); i < (one << wsize); i++)
    {
      esp32c3_mpi_free(&W[i]);
    }

  esp32c3_mpi_free(&W[1]);
  esp32c3_mpi_free(&T);
  esp32c3_mpi_free(&apos);

  if (_RR == NULL || _RR->p == NULL)
    {
      esp32c3_mpi_free(&RR);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_gcd
 *
 * Description:
 *   Compute the greatest common divisor: G = gcd(A, B)
 *
 * Input Parameters:
 *   G       - The destination MPI
 *   A       - The first operand
 *   B       - The second operand
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_gcd(struct esp32c3_mpi_s *G,
                    const struct esp32c3_mpi_s *A,
                    const struct esp32c3_mpi_s *B)
{
  int ret;
  size_t lz;
  size_t lzt;
  struct esp32c3_mpi_s TG;
  struct esp32c3_mpi_s TA;
  struct esp32c3_mpi_s TB;

  DEBUGASSERT(G != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(B != NULL);

  esp32c3_mpi_init(&TG); esp32c3_mpi_init(&TA); esp32c3_mpi_init(&TB);

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TA, A), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TB, B), cleanup);

  lz = esp32c3_mpi_lsb(&TA);
  lzt = esp32c3_mpi_lsb(&TB);

  if (lzt < lz)
    {
      lz = lzt;
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TA, lz), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TB, lz), cleanup);

  TA.s = TB.s = 1;

  while (esp32c3_mpi_cmp_int(&TA, 0) != 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TA, esp32c3_mpi_lsb(&TA)),
                      cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TB, esp32c3_mpi_lsb(&TB)),
                      cleanup);

      if (esp32c3_mpi_cmp_mpi(&TA, &TB) >= 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(&TA, &TA, &TB), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TA, 1), cleanup);
        }
      else
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_abs(&TB, &TB, &TA), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TB, 1), cleanup);
        }
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_shift_l(&TB, lz), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(G, &TB), cleanup);

cleanup:
  esp32c3_mpi_free(&TG); esp32c3_mpi_free(&TA); esp32c3_mpi_free(&TB);
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_fill_random
 *
 * Description:
 *   Fill an MPI with a number of random bytes
 *
 * Input Parameters:
 *   X        - The destination MPI
 *   size     - The number of random bytes to generate
 *   f_rng    - The RNG function to use. This must not be \c NULL
 *   p_rng    - The RNG parameter to be passed to \p f_rng
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_fill_random(struct esp32c3_mpi_s *X, size_t size,
                            int (*f_rng)(void *, unsigned char *, size_t),
                            void *p_rng)
{
  int ret;
  size_t const limbs = CHARS_TO_LIMBS(size);
  size_t const overhead = (limbs * CIL) - size;
  unsigned char *XP;

  DEBUGASSERT(X   != NULL);
  DEBUGASSERT(f_rng != NULL);

  /* Ensure that target MPI has exactly the necessary number of limbs */

  if (X->n != limbs)
    {
      esp32c3_mpi_free(X);
      esp32c3_mpi_init(X);
      ESP32C3_MPI_CHK(esp32c3_mpi_grow(X, limbs), cleanup);
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_lset(X, 0), cleanup);

