apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_bignum.c
  XP = (unsigned char *) X->p;
  ESP32C3_MPI_CHK(f_rng(p_rng, XP + overhead, size), cleanup);

  mpi_bigendian_to_host(X->p, limbs);

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_mpi_inv_mod
 *
 * Description:
 *   Compute the modular inverse: X = A^-1 mod N
 *
 * Input Parameters:
 *   X        - The destination MPI
 *   A        - The MPI to calculate the modular inverse of
 *   N        - The base of the modular inversion
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_mpi_inv_mod(struct esp32c3_mpi_s *X,
                        const struct esp32c3_mpi_s *A,
                        const struct esp32c3_mpi_s *N)
{
  int ret;
  struct esp32c3_mpi_s G;
  struct esp32c3_mpi_s TA;
  struct esp32c3_mpi_s TU;
  struct esp32c3_mpi_s U1;
  struct esp32c3_mpi_s U2;
  struct esp32c3_mpi_s TB;
  struct esp32c3_mpi_s TV;
  struct esp32c3_mpi_s V1;
  struct esp32c3_mpi_s V2;

  DEBUGASSERT(X != NULL);
  DEBUGASSERT(A != NULL);
  DEBUGASSERT(N != NULL);

  if (esp32c3_mpi_cmp_int(N, 1) <= 0)
    {
      return ESP32C3_ERR_MPI_BAD_INPUT_DATA;
    }

  esp32c3_mpi_init(&TA);
  esp32c3_mpi_init(&TU);
  esp32c3_mpi_init(&U1);
  esp32c3_mpi_init(&U2);
  esp32c3_mpi_init(&G);
  esp32c3_mpi_init(&TB);
  esp32c3_mpi_init(&TV);
  esp32c3_mpi_init(&V1);
  esp32c3_mpi_init(&V2);

  ESP32C3_MPI_CHK(esp32c3_mpi_gcd(&G, A, N), cleanup);

  if (esp32c3_mpi_cmp_int(&G, 1) != 0)
    {
      ret = ESP32C3_ERR_MPI_NOT_ACCEPTABLE;
      goto cleanup;
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&TA, A, N), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TU, &TA), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TB, N), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&TV, N), cleanup);

  ESP32C3_MPI_CHK(esp32c3_mpi_lset(&U1, 1), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_lset(&U2, 0), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_lset(&V1, 0), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_lset(&V2, 1), cleanup);

  do
    {
      while ((TU.p[0] & 1) == 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TU, 1), cleanup);

          if ((U1.p[0] & 1) != 0 || (U2.p[0] & 1) != 0)
            {
              ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&U1, &U1, &TB), cleanup);
              ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&U2, &U2, &TA), cleanup);
            }

          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&U1, 1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&U2, 1), cleanup);
        }

      while ((TV.p[0] & 1) == 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&TV, 1), cleanup);

          if ((V1.p[0] & 1) != 0 || (V2.p[0] & 1) != 0)
            {
              ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&V1, &V1, &TB), cleanup);
              ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&V2, &V2, &TA), cleanup);
            }

          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&V1, 1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&V2, 1), cleanup);
        }

      if (esp32c3_mpi_cmp_mpi(&TU, &TV) >= 0)
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&TU, &TU, &TV), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&U1, &U1, &V1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&U2, &U2, &V2), cleanup);
        }
      else
        {
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&TV, &TV, &TU), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&V1, &V1, &U1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&V2, &V2, &U2), cleanup);
        }
    }
  while (esp32c3_mpi_cmp_int(&TU, 0) != 0);

  while (esp32c3_mpi_cmp_int(&V1, 0) < 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&V1, &V1, N), cleanup);
    }

  while (esp32c3_mpi_cmp_mpi(&V1, N) >= 0)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&V1, &V1, N), cleanup);
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(X, &V1), cleanup);

cleanup:
  esp32c3_mpi_free(&TA);
  esp32c3_mpi_free(&TU);
  esp32c3_mpi_free(&U1);
  esp32c3_mpi_free(&U2);
  esp32c3_mpi_free(&G);
  esp32c3_mpi_free(&TB);
  esp32c3_mpi_free(&TV);
  esp32c3_mpi_free(&V1);
  esp32c3_mpi_free(&V2);

  return ret;
}

#endif /* CONFIG_ESP32C3_BIGNUM_ACCELERATOR */

